tutorials/incompressible/pimpleFoam/laminar/contaminatedDroplet2D/system/finite-area/faSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Cs
    {
        //solver          PBiCG;
        solver          PBiCGStab;
        preconditioner  DILU;
        minIter         0;
        maxIter         2000;
        tolerance       1e-8;
        relTol          0;
    }
}

PISO
{
    nCorrectors                2;
    nNonOrthogonalCorrectors   0;
}

SIMPLE
{
    nTimeCorrectors             6;
    nNonOrthogonalCorrectors    1;
}

relaxationFactors
{
    p               0.7;
    U               0.7;
    k               0.7;
    epsilon         0.7;
    R               0.7;
}


// ************************************************************************* //
